/// 操作符1
#include <stdio.h>
/*
算术操作符:
    + - * / %

移位操作符
    >> <<

位操作符
    & ^ |

赋值操作符
    = += -= *= /= &= ^= |= >>= <<=

单目操作符
    ! 逻辑反操作
    - 负值
    + 正值
    & 取地址
    sizeof 操作数的类型长度(以字节为单位)
    ~ 对一个数的二进制按位取反
    -- 前置 后置--
    ++ 前置 后置++
    * 间接访问操作符(解引用操作符)
    (类型) 强制类型转换

关系操作符
    > >= < <= != ==

逻辑操作符
    && 逻辑与
    || 逻辑或

条件操作符 (三目操作符)
    exp1? exp2 : exp3

逗号表达式
    exp1, exp2, exp3, ...expN

下标引用\函数调用和结构成员
    [] () . ->

*/
int main(int argc, char const *argv[])
{
    int a = 9 / 2;     // 得到的是商,不会得到余数
    printf("%d\n", a); // 4

    float a = 9 / 2; // 4.000000
    // 除号两端如果都是整数,那么除完后的结果是整数

    float a = 9 / 2.0; // 4.5
    // 除号两端有一个小数,那么就按小数的算法算

    int a = 9 % 2; //% -   取模(余)

    // 左移操作符--移动的事二进制位
    int a = 2; // 2的二进制(32位): 00000000000000000000000000000010
    int b = a << 1;
    printf("%d\n", b);

    // & 按位与
    // | 按位或
    // ^ 按位异或

    // 0表示假, 非0表示真
    int a = 0;
    printf("%d\n", !a); // 1
    if (a)
    {
        /* 如果a为真 */
    }

    // sizeof 是一个操作符, 不是函数, sizeof后面的括号可以省略
    // 计算类型或者变量的大小
    int a = 10;
    printf("%d\n", sizeof(int));
    printf("%d\n", sizeof(a));
    printf("%d\n", sizeof a);

    // 10*4 = 40
    int arr[10] = {0};
    printf("%d\n", sizeof(arr));           // 计算的是数组的总大小, 单位是字节
    printf("%d\n", sizeof(arr[0]));        // 4
    int sz = sizeof(arr) / sizeof(arr[0]); // 计算数组元素个数
    printf("%d\n", sz);

    return 0;
}
