#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <string.h>
#include <math.h>
/// 操作符详解 2
/*操作符分类:
    算术操作符
        + - * / %
    移位操作符
        >>  <<
    位操作符
        &按位与  |按位或  ^按位异或
    赋值操作符
        = += -= *= /= >>=  <<= %= |= ^=
    单目操作符
        ! 逻辑反操作
        - + & sizeof ~ -- ++
        * 间接访问操作符(解引用操作符)
        (类型) 强制类型转换
    关系操作符
    逻辑操作符
    条件操作符
    逗号表达式
    下标引用/函数调用和结构成员
*/

int main(int argc, char const *argv[])
{
    /// 赋值操作符
    int weight = 120; // 体重
    weight = 89;      // 不满意体重就赋值

    // 赋值操作符可以连续使用, 比如:
    int a = 10;
    int x = 0;
    int y = 20;
    a = x = y + 1; // 连续赋值(这种代码不容易理解)
    // 这样写更加清爽而且易于调试.
    x = y + 1;
    a = x;

    a += 100; // 写法等价于 a = a + 100

    /// 单目操作符 - 只有一个操作数
    int a = 10;
    printf("%d\n", sizeof(a));   // 4; 计算a所占空间的大小, 单位是字节
    printf("%d\n", sizeof(int)); // 4

    printf("%d\n", sizeof a); // 4
    // 证明sizeof是操作符, 不是函数; 如果是函数,()不能省略

    char arr[10] = {0};
    printf("%d\n", sizeof(arr));     // 10(单位字节)
    printf("%d\n", sizeof(int[10])); // 40(单位字节) - int[10] 是arr数组类型

    short s = 5;
    int a = 10;
    printf("%d\n", sizeof(s = a + 2)); // 2 (short占两个字节, 不会因为你放int而变化)
    printf("%d\n", s);                 // 5 (sizeof括号中放的表达式是不参与运算的!)
    /*
    从源文件(test.c)到可执行程序(test.exe),
    需要经历: 编译 链接 运行

    sizeof计算 s=a+2 大小的时候, 是在编译时进行的, 不是运行时计算的, 并没有把a+2的结果放到s里面去
    */

    int a = -1;
    // 100000000000000000000000000001 - 原码
    // 111111111111111111111111111110 - 反码
    // 111111111111111111111111111111 - 补码
    // ~ 按位取反
    // 111111111111111111111111111111
    // 000000000000000000000000000000
    int b = ~a; // 0; 是对内存里面的值取反, 内存存储的是补码

    // 练习一:把a的二进制中的第5位置换成1
    int a = 13;
    // 把a的二进制中的第5位置换成1
    a = a | (1 << 4);
    printf("a = %d\n", a); // 29

    // 把a的二进制中第5位置换成0
    a = a & ~(1 << 4);
    printf("a = %d\n", a); // 13
    // 000000000000000000000000010000 // 1<<4
    // 111111111111111111111111101111 // ~(1<<4)
    // 000000000000000000000000011101 // 13
    // 000000000000000000000000001101 // a & ~(1 << 4)

    int a = 10;
    int b = a++;       // 后置++, 先使用, 再++
    printf("%d\n", a); // 11
    printf("%d\n", b); // 10

    int b = ++a;       // 前置++, 先++, 后使用
    printf("%d\n", a); // 11
    printf("%d\n", b); // 11

    int a = 10;
    printf("%d\n", a--); // 10
    printf("%d\n", a);   // 9
}